app/views/detail/index.html.erb

INSERT INTO `user_logs` (`user_id`, `log_data`, `created_at`, `updated_at`) VALUES (2, 'This is first log of User2', '2015-11-21 21:03:06', '2015-11-21 21:03:06')
---
							<td><%= user_log.log_data %></td>
							<td><%= user_log.created_at.in_time_zone(7) %></td>