app/controllers/contact_controller.rb

  def index
  	@messages_contact = ContactMessage.all
---
SELECT `contact_messages`.* FROM `contact_messages`

  def contact
  	@contact = ContactMessage.create(contact_params)
---
INSERT INTO `contact_messages` (`name`, `company`, `email`, `message`, `created_at`, `updated_at`) VALUES ('DKM', '1', '1', 'ckm', '2015-11-25 05:43:53', '2015-11-25 05:43:53')