app/controllers/detail_controller.rb

	def update
		@user_info = UserInfo.create(user_info_params)
		user = current_user
		user.name = @user_info.name
		user.gender = @user_info.gender
		user.age = @user_info.age
		user.address = @user_info.address
		user.p_num = @user_info.p_num
		user.save
---
INSERT INTO `user_infos` (`name`, `gender`, `age`, `address`, `p_num`, `created_at`, `updated_at`) VALUES ('Hoang Ngoc Quy', 'Male', 22, 'No 1 Dai Co Viet', '01658943584', '2015-11-25 02:40:53', '2015-11-25 02:40:53')
UPDATE `users` SET `name` = 'Ngoc Quy Hoang', `gender` = 'Female', `age` = 26, `address` = 'No 2 Dai Co Viet', `p_num` = '01662786954', `updated_at` = '2015-11-25 02:41:40' WHERE `users`.`id` = 1