app/controllers/user_logs_controller.rb

  def index
    @user_logs = UserLog.all
---
SELECT `user_logs`.* FROM `user_logs`

  def create
    @user_log = UserLog.new(user_log_params)

    respond_to do |format|
      if @user_log.save
---
INSERT INTO `user_logs` (`user_id`, `log_data`, `created_at`, `updated_at`) VALUES (1, 'User 1 is sign in', '2015-11-21 20:17:51', '2015-11-21 20:17:51')

    def set_user_log
      @user_log = UserLog.find(params[:id])
---
SELECT  `user_logs`.* FROM `user_logs` WHERE `user_logs`.`id` = 1 LIMIT 1