app/controllers/users/sessions_controller.rb

INSERT INTO `user_logs` (`user_id`, `log_data`, `created_at`, `updated_at`) VALUES (1, 'ngocquyhoang@gmail.com is Sign in', '2015-11-21 21:31:57', '2015-11-21 21:31:57')
UPDATE `users` SET `last_sign_in_at` = '2015-11-25 11:19:05', `current_sign_in_at` = '2015-11-25 11:19:05', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2015-11-25 11:19:05' WHERE `users`.`id` = 1
---
  def create
    newLog = UserLog.create user_id: current_user.id , log_data: current_user.email + " is Sign in"
    newLog.save

INSERT INTO `user_logs` (`user_id`, `log_data`, `created_at`, `updated_at`) VALUES (1, 'ngocquyhoang@gmail.com is Sign out', '2015-11-21 21:22:04', '2015-11-21 21:22:04')
---
  def destroy
    newLog = UserLog.create user_id: current_user.id , log_data: current_user.email + " is Sign out"